IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/ICSSM_INTR_XBAR_ICSSM_INTR_XBAR.xml
<module name="ICSSM_INTR_XBAR_ICSSM_INTR_XBAR" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="ICSSM_INTR_XBAR_PID" acronym="ICSSM_INTR_XBAR_PID" offset="0x0" width="32" description="">
		<bitfield id="SCHEME" width="2" begin="31" end="30" resetval="0x1" description="scheme" range="31 - 30" rwaccess="RO"/> 
		<bitfield id="BU" width="2" begin="29" end="28" resetval="0x2" description="bu" range="29 - 28" rwaccess="RO"/> 
		<bitfield id="FUNCTION" width="12" begin="27" end="16" resetval="0x1684" description="function" range="27 - 16" rwaccess="RO"/> 
		<bitfield id="RTLVER" width="5" begin="15" end="11" resetval="0x16" description="rtl version" range="15 - 11" rwaccess="RO"/> 
		<bitfield id="MAJREV" width="3" begin="10" end="8" resetval="0x1" description="major version" range="10 - 8" rwaccess="RO"/> 
		<bitfield id="CUSTOM" width="2" begin="7" end="6" resetval="0x0" description="custom id" range="7 - 6" rwaccess="RO"/> 
		<bitfield id="MINREV" width="6" begin="5" end="0" resetval="0x0" description="minor version" range="5 - 0" rwaccess="RO"/>
	</register>
	<register id="ICSSM_INTR_XBAR_MUXCNTL" acronym="ICSSM_INTR_XBAR_MUXCNTL" offset="0x4" width="16" description="">
		<bitfield id="INT_ENABLE" width="1" begin="16" end="16" resetval="0x0" description="interrupt output enable for interrupt N" range="16" rwaccess="RW"/> 
		<bitfield id="ENABLE" width="6" begin="5" end="0" resetval="0x0" description="Mux control for interrupt N" range="5 - 0" rwaccess="RW"/>
	</register>
</module>